name: "irv2"

layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  image_data_param {
    source: "/furniture/data/train.txt"
    root_folder: "/furniture/data/"
    batch_size: 80
    new_height: 299
    new_width: 299
    shuffle: true
  }
  transform_param {
    mirror: true
    mean_value: 103.939
    mean_value: 116.779
    mean_value: 123.68
  }
  include {
      phase: TRAIN
  }
}

layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  image_data_param {
    source: "/furniture/data/valid.txt"
    root_folder: "/furniture/data/val/"
    shuffle: true
    batch_size: 80
    new_height: 299
    new_width: 299
  }
  transform_param {
    mirror: false
    mean_value: 103.939
    mean_value: 116.779
    mean_value: 123.68
    }
  include {
    phase: TEST
  }
}

layer{
   name: "gather"
   type: "Gather"
   bottom: "label"
   top: "label_g"
}


layer {
  name: "stem_base/Conv2d_1a_3x3"
  type: "ConvolutionData"
  bottom: "data"
  top: "stem_base/Conv2d_1a_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "stem_base/Conv2d_1a_3x3/bn"
  type: "BNData"
  bottom: "stem_base/Conv2d_1a_3x3"
  top: "stem_base/Conv2d_1a_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "stem_base/Conv2d_1a_3x3/bn/relu"
  type: "ReLU"
  bottom: "stem_base/Conv2d_1a_3x3/bn"
  top: "stem_base/Conv2d_1a_3x3/bn"
}
layer {
  name: "stem_base/Conv2d_2a_3x3"
  type: "ConvolutionData"
  bottom: "stem_base/Conv2d_1a_3x3/bn"
  top: "stem_base/Conv2d_2a_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "stem_base/Conv2d_2a_3x3/bn"
  type: "BNData"
  bottom: "stem_base/Conv2d_2a_3x3"
  top: "stem_base/Conv2d_2a_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "stem_base/Conv2d_2a_3x3/bn/relu"
  type: "ReLU"
  bottom: "stem_base/Conv2d_2a_3x3/bn"
  top: "stem_base/Conv2d_2a_3x3/bn"
}
layer {
  name: "stem_base/Conv2d_2b_3x3"
  type: "ConvolutionData"
  bottom: "stem_base/Conv2d_2a_3x3/bn"
  top: "stem_base/Conv2d_2b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "stem_base/Conv2d_2b_3x3/bn"
  type: "BNData"
  bottom: "stem_base/Conv2d_2b_3x3"
  top: "stem_base/Conv2d_2b_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "stem_base/Conv2d_2b_3x3/bn/relu"
  type: "ReLU"
  bottom: "stem_base/Conv2d_2b_3x3/bn"
  top: "stem_base/Conv2d_2b_3x3/bn"
}
layer {
  name: "stem_base/MaxPool_3a_3x3"
  type: "Pooling"
  bottom: "stem_base/Conv2d_2b_3x3/bn"
  top: "stem_base/MaxPool_3a_3x3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "stem_base/Conv2d_3b_1x1"
  type: "ConvolutionData"
  bottom: "stem_base/MaxPool_3a_3x3"
  top: "stem_base/Conv2d_3b_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 80
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "stem_base/Conv2d_3b_1x1/bn"
  type: "BNData"
  bottom: "stem_base/Conv2d_3b_1x1"
  top: "stem_base/Conv2d_3b_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "stem_base/Conv2d_3b_1x1/bn/relu"
  type: "ReLU"
  bottom: "stem_base/Conv2d_3b_1x1/bn"
  top: "stem_base/Conv2d_3b_1x1/bn"
}
layer {
  name: "stem_base/Conv2d_4a_3x3"
  type: "ConvolutionData"
  bottom: "stem_base/Conv2d_3b_1x1/bn"
  top: "stem_base/Conv2d_4a_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    bias_term: false
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "stem_base/Conv2d_4a_3x3/bn"
  type: "BNData"
  bottom: "stem_base/Conv2d_4a_3x3"
  top: "stem_base/Conv2d_4a_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "stem_base/Conv2d_4a_3x3/bn/relu"
  type: "ReLU"
  bottom: "stem_base/Conv2d_4a_3x3/bn"
  top: "stem_base/Conv2d_4a_3x3/bn"
}
layer {
  name: "stem_base/MaxPool_5a_3x3"
  type: "Pooling"
  bottom: "stem_base/Conv2d_4a_3x3/bn"
  top: "stem_base/MaxPool_5a_3x3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "stem_mixed/branch_0/Conv2d_1x1"
  type: "ConvolutionData"
  bottom: "stem_base/MaxPool_5a_3x3"
  top: "stem_mixed/branch_0/Conv2d_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "stem_mixed/branch_0/Conv2d_1x1/bn"
  type: "BNData"
  bottom: "stem_mixed/branch_0/Conv2d_1x1"
  top: "stem_mixed/branch_0/Conv2d_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "stem_mixed/branch_0/Conv2d_1x1/bn/relu"
  type: "ReLU"
  bottom: "stem_mixed/branch_0/Conv2d_1x1/bn"
  top: "stem_mixed/branch_0/Conv2d_1x1/bn"
}
layer {
  name: "stem_mixed/branch_0/Conv2d_0a_1x1"
  type: "ConvolutionData"
  bottom: "stem_base/MaxPool_5a_3x3"
  top: "stem_mixed/branch_0/Conv2d_0a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "stem_mixed/branch_0/Conv2d_0a_1x1/bn"
  type: "BNData"
  bottom: "stem_mixed/branch_0/Conv2d_0a_1x1"
  top: "stem_mixed/branch_0/Conv2d_0a_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "stem_mixed/branch_0/Conv2d_0a_1x1/bn/relu"
  type: "ReLU"
  bottom: "stem_mixed/branch_0/Conv2d_0a_1x1/bn"
  top: "stem_mixed/branch_0/Conv2d_0a_1x1/bn"
}
layer {
  name: "stem_mixed/branch_1/Conv2d_0b_5x5"
  type: "ConvolutionData"
  bottom: "stem_mixed/branch_0/Conv2d_0a_1x1/bn"
  top: "stem_mixed/branch_1/Conv2d_0b_5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "stem_mixed/branch_1/Conv2d_0b_5x5/bn"
  type: "BNData"
  bottom: "stem_mixed/branch_1/Conv2d_0b_5x5"
  top: "stem_mixed/branch_1/Conv2d_0b_5x5/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "stem_mixed/branch_1/Conv2d_0b_5x5/bn/relu"
  type: "ReLU"
  bottom: "stem_mixed/branch_1/Conv2d_0b_5x5/bn"
  top: "stem_mixed/branch_1/Conv2d_0b_5x5/bn"
}
layer {
  name: "stem_mixed/branch_2/Conv2d_0a_1x1"
  type: "ConvolutionData"
  bottom: "stem_base/MaxPool_5a_3x3"
  top: "stem_mixed/branch_2/Conv2d_0a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "stem_mixed/branch_2/Conv2d_0a_1x1/bn"
  type: "BNData"
  bottom: "stem_mixed/branch_2/Conv2d_0a_1x1"
  top: "stem_mixed/branch_2/Conv2d_0a_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "stem_mixed/branch_2/Conv2d_0a_1x1/bn/relu"
  type: "ReLU"
  bottom: "stem_mixed/branch_2/Conv2d_0a_1x1/bn"
  top: "stem_mixed/branch_2/Conv2d_0a_1x1/bn"
}
layer {
  name: "stem_mixed/branch_2/Conv2d_0b_3x3"
  type: "ConvolutionData"
  bottom: "stem_mixed/branch_2/Conv2d_0a_1x1/bn"
  top: "stem_mixed/branch_2/Conv2d_0b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "stem_mixed/branch_2/Conv2d_0b_3x3/bn"
  type: "BNData"
  bottom: "stem_mixed/branch_2/Conv2d_0b_3x3"
  top: "stem_mixed/branch_2/Conv2d_0b_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "stem_mixed/branch_2/Conv2d_0b_3x3/bn/relu"
  type: "ReLU"
  bottom: "stem_mixed/branch_2/Conv2d_0b_3x3/bn"
  top: "stem_mixed/branch_2/Conv2d_0b_3x3/bn"
}
layer {
  name: "stem_mixed/branch_2/Conv2d_0c_3x3"
  type: "ConvolutionData"
  bottom: "stem_mixed/branch_2/Conv2d_0b_3x3/bn"
  top: "stem_mixed/branch_2/Conv2d_0c_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "stem_mixed/branch_2/Conv2d_0c_3x3/bn"
  type: "BNData"
  bottom: "stem_mixed/branch_2/Conv2d_0c_3x3"
  top: "stem_mixed/branch_2/Conv2d_0c_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "stem_mixed/branch_2/Conv2d_0c_3x3/bn/relu"
  type: "ReLU"
  bottom: "stem_mixed/branch_2/Conv2d_0c_3x3/bn"
  top: "stem_mixed/branch_2/Conv2d_0c_3x3/bn"
}
layer {
  name: "stem_mixed/branch_3/AvgPool_0a_3x3"
  type: "Pooling"
  bottom: "stem_base/MaxPool_5a_3x3"
  top: "stem_mixed/branch_3/AvgPool_0a_3x3"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "stem_mixed/branch_3/Con2d_0b_1x1"
  type: "ConvolutionData"
  bottom: "stem_mixed/branch_3/AvgPool_0a_3x3"
  top: "stem_mixed/branch_3/Con2d_0b_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "stem_mixed/branch_3/Con2d_0b_1x1/bn"
  type: "BNData"
  bottom: "stem_mixed/branch_3/Con2d_0b_1x1"
  top: "stem_mixed/branch_3/Con2d_0b_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "stem_mixed/branch_3/Con2d_0b_1x1/bn/relu"
  type: "ReLU"
  bottom: "stem_mixed/branch_3/Con2d_0b_1x1/bn"
  top: "stem_mixed/branch_3/Con2d_0b_1x1/bn"
}
layer {
  name: "stem_mixed/concat"
  type: "Concat"
  bottom: "stem_mixed/branch_0/Conv2d_1x1/bn"
  bottom: "stem_mixed/branch_1/Conv2d_0b_5x5/bn"
  bottom: "stem_mixed/branch_2/Conv2d_0c_3x3/bn"
  bottom: "stem_mixed/branch_3/Con2d_0b_1x1/bn"
  top: "stem_mixed/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block35_1/branch_0/Conv2d_1x1"
  type: "ConvolutionData"
  bottom: "stem_mixed/concat"
  top: "block35_1/branch_0/Conv2d_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_1/branch_0/Conv2d_1x1/bn"
  type: "BNData"
  bottom: "block35_1/branch_0/Conv2d_1x1"
  top: "block35_1/branch_0/Conv2d_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_1/branch_0/Conv2d_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_1/branch_0/Conv2d_1x1/bn"
  top: "block35_1/branch_0/Conv2d_1x1/bn"
}
layer {
  name: "block35_1/branch_1/Conv2d_0a_1x1"
  type: "ConvolutionData"
  bottom: "stem_mixed/concat"
  top: "block35_1/branch_1/Conv2d_0a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_1/branch_1/Conv2d_0a_1x1/bn"
  type: "BNData"
  bottom: "block35_1/branch_1/Conv2d_0a_1x1"
  top: "block35_1/branch_1/Conv2d_0a_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_1/branch_1/Conv2d_0a_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_1/branch_1/Conv2d_0a_1x1/bn"
  top: "block35_1/branch_1/Conv2d_0a_1x1/bn"
}
layer {
  name: "block35_1/branch_1/Conv2d_0b_3x3"
  type: "ConvolutionData"
  bottom: "block35_1/branch_1/Conv2d_0a_1x1/bn"
  top: "block35_1/branch_1/Conv2d_0b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_1/branch_1/Conv2d_0b_3x3/bn"
  type: "BNData"
  bottom: "block35_1/branch_1/Conv2d_0b_3x3"
  top: "block35_1/branch_1/Conv2d_0b_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_1/branch_1/Conv2d_0b_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_1/branch_1/Conv2d_0b_3x3/bn"
  top: "block35_1/branch_1/Conv2d_0b_3x3/bn"
}
layer {
  name: "block35_1/branch_2/Conv2d_0a_1x1"
  type: "ConvolutionData"
  bottom: "stem_mixed/concat"
  top: "block35_1/branch_2/Conv2d_0a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_1/branch_2/Conv2d_0a_1x1/bn"
  type: "BNData"
  bottom: "block35_1/branch_2/Conv2d_0a_1x1"
  top: "block35_1/branch_2/Conv2d_0a_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_1/branch_2/Conv2d_0a_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_1/branch_2/Conv2d_0a_1x1/bn"
  top: "block35_1/branch_2/Conv2d_0a_1x1/bn"
}
layer {
  name: "block35_1/branch_2/Conv2d_0b_3x3"
  type: "ConvolutionData"
  bottom: "block35_1/branch_2/Conv2d_0a_1x1/bn"
  top: "block35_1/branch_2/Conv2d_0b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_1/branch_2/Conv2d_0b_3x3/bn"
  type: "BNData"
  bottom: "block35_1/branch_2/Conv2d_0b_3x3"
  top: "block35_1/branch_2/Conv2d_0b_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_1/branch_2/Conv2d_0b_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_1/branch_2/Conv2d_0b_3x3/bn"
  top: "block35_1/branch_2/Conv2d_0b_3x3/bn"
}
layer {
  name: "block35_1/branch_2/Conv2d_0c_3x3"
  type: "ConvolutionData"
  bottom: "block35_1/branch_2/Conv2d_0b_3x3/bn"
  top: "block35_1/branch_2/Conv2d_0c_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_1/branch_2/Conv2d_0c_3x3/bn"
  type: "BNData"
  bottom: "block35_1/branch_2/Conv2d_0c_3x3"
  top: "block35_1/branch_2/Conv2d_0c_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_1/branch_2/Conv2d_0c_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_1/branch_2/Conv2d_0c_3x3/bn"
  top: "block35_1/branch_2/Conv2d_0c_3x3/bn"
}
layer {
  name: "block35_1/concat"
  type: "Concat"
  bottom: "block35_1/branch_0/Conv2d_1x1/bn"
  bottom: "block35_1/branch_1/Conv2d_0b_3x3/bn"
  bottom: "block35_1/branch_2/Conv2d_0c_3x3/bn"
  top: "block35_1/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block35_1/concat/Conv2d_1x1"
  type: "ConvolutionData"
  bottom: "block35_1/concat"
  top: "block35_1/concat/Conv2d_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "block35_1/eltwise"
  type: "Eltwise"
  bottom: "stem_mixed/concat"
  bottom: "block35_1/concat/Conv2d_1x1"
  top: "block35_1/eltwise"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.17
  }
}
layer {
  name: "block35_1/eltwise/relu"
  type: "ReLU"
  bottom: "block35_1/eltwise"
  top: "block35_1/eltwise"
}
layer {
  name: "block35_2/branch_0/Conv2d_1x1"
  type: "ConvolutionData"
  bottom: "block35_1/eltwise"
  top: "block35_2/branch_0/Conv2d_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_2/branch_0/Conv2d_1x1/bn"
  type: "BNData"
  bottom: "block35_2/branch_0/Conv2d_1x1"
  top: "block35_2/branch_0/Conv2d_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_2/branch_0/Conv2d_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_2/branch_0/Conv2d_1x1/bn"
  top: "block35_2/branch_0/Conv2d_1x1/bn"
}
layer {
  name: "block35_2/branch_1/Conv2d_0a_1x1"
  type: "ConvolutionData"
  bottom: "block35_1/eltwise"
  top: "block35_2/branch_1/Conv2d_0a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_2/branch_1/Conv2d_0a_1x1/bn"
  type: "BNData"
  bottom: "block35_2/branch_1/Conv2d_0a_1x1"
  top: "block35_2/branch_1/Conv2d_0a_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_2/branch_1/Conv2d_0a_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_2/branch_1/Conv2d_0a_1x1/bn"
  top: "block35_2/branch_1/Conv2d_0a_1x1/bn"
}
layer {
  name: "block35_2/branch_1/Conv2d_0b_3x3"
  type: "ConvolutionData"
  bottom: "block35_2/branch_1/Conv2d_0a_1x1/bn"
  top: "block35_2/branch_1/Conv2d_0b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_2/branch_1/Conv2d_0b_3x3/bn"
  type: "BNData"
  bottom: "block35_2/branch_1/Conv2d_0b_3x3"
  top: "block35_2/branch_1/Conv2d_0b_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_2/branch_1/Conv2d_0b_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_2/branch_1/Conv2d_0b_3x3/bn"
  top: "block35_2/branch_1/Conv2d_0b_3x3/bn"
}
layer {
  name: "block35_2/branch_2/Conv2d_0a_1x1"
  type: "ConvolutionData"
  bottom: "block35_1/eltwise"
  top: "block35_2/branch_2/Conv2d_0a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_2/branch_2/Conv2d_0a_1x1/bn"
  type: "BNData"
  bottom: "block35_2/branch_2/Conv2d_0a_1x1"
  top: "block35_2/branch_2/Conv2d_0a_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_2/branch_2/Conv2d_0a_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_2/branch_2/Conv2d_0a_1x1/bn"
  top: "block35_2/branch_2/Conv2d_0a_1x1/bn"
}
layer {
  name: "block35_2/branch_2/Conv2d_0b_3x3"
  type: "ConvolutionData"
  bottom: "block35_2/branch_2/Conv2d_0a_1x1/bn"
  top: "block35_2/branch_2/Conv2d_0b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_2/branch_2/Conv2d_0b_3x3/bn"
  type: "BNData"
  bottom: "block35_2/branch_2/Conv2d_0b_3x3"
  top: "block35_2/branch_2/Conv2d_0b_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_2/branch_2/Conv2d_0b_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_2/branch_2/Conv2d_0b_3x3/bn"
  top: "block35_2/branch_2/Conv2d_0b_3x3/bn"
}
layer {
  name: "block35_2/branch_2/Conv2d_0c_3x3"
  type: "ConvolutionData"
  bottom: "block35_2/branch_2/Conv2d_0b_3x3/bn"
  top: "block35_2/branch_2/Conv2d_0c_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_2/branch_2/Conv2d_0c_3x3/bn"
  type: "BNData"
  bottom: "block35_2/branch_2/Conv2d_0c_3x3"
  top: "block35_2/branch_2/Conv2d_0c_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_2/branch_2/Conv2d_0c_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_2/branch_2/Conv2d_0c_3x3/bn"
  top: "block35_2/branch_2/Conv2d_0c_3x3/bn"
}
layer {
  name: "block35_2/concat"
  type: "Concat"
  bottom: "block35_2/branch_0/Conv2d_1x1/bn"
  bottom: "block35_2/branch_1/Conv2d_0b_3x3/bn"
  bottom: "block35_2/branch_2/Conv2d_0c_3x3/bn"
  top: "block35_2/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block35_2/concat/Conv2d_1x1"
  type: "ConvolutionData"
  bottom: "block35_2/concat"
  top: "block35_2/concat/Conv2d_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "block35_2/eltwise"
  type: "Eltwise"
  bottom: "block35_1/eltwise"
  bottom: "block35_2/concat/Conv2d_1x1"
  top: "block35_2/eltwise"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.17
  }
}
layer {
  name: "block35_2/eltwise/relu"
  type: "ReLU"
  bottom: "block35_2/eltwise"
  top: "block35_2/eltwise"
}
layer {
  name: "block35_3/branch_0/Conv2d_1x1"
  type: "ConvolutionData"
  bottom: "block35_2/eltwise"
  top: "block35_3/branch_0/Conv2d_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_3/branch_0/Conv2d_1x1/bn"
  type: "BNData"
  bottom: "block35_3/branch_0/Conv2d_1x1"
  top: "block35_3/branch_0/Conv2d_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_3/branch_0/Conv2d_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_3/branch_0/Conv2d_1x1/bn"
  top: "block35_3/branch_0/Conv2d_1x1/bn"
}
layer {
  name: "block35_3/branch_1/Conv2d_0a_1x1"
  type: "ConvolutionData"
  bottom: "block35_2/eltwise"
  top: "block35_3/branch_1/Conv2d_0a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_3/branch_1/Conv2d_0a_1x1/bn"
  type: "BNData"
  bottom: "block35_3/branch_1/Conv2d_0a_1x1"
  top: "block35_3/branch_1/Conv2d_0a_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_3/branch_1/Conv2d_0a_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_3/branch_1/Conv2d_0a_1x1/bn"
  top: "block35_3/branch_1/Conv2d_0a_1x1/bn"
}
layer {
  name: "block35_3/branch_1/Conv2d_0b_3x3"
  type: "ConvolutionData"
  bottom: "block35_3/branch_1/Conv2d_0a_1x1/bn"
  top: "block35_3/branch_1/Conv2d_0b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_3/branch_1/Conv2d_0b_3x3/bn"
  type: "BNData"
  bottom: "block35_3/branch_1/Conv2d_0b_3x3"
  top: "block35_3/branch_1/Conv2d_0b_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_3/branch_1/Conv2d_0b_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_3/branch_1/Conv2d_0b_3x3/bn"
  top: "block35_3/branch_1/Conv2d_0b_3x3/bn"
}
layer {
  name: "block35_3/branch_2/Conv2d_0a_1x1"
  type: "ConvolutionData"
  bottom: "block35_2/eltwise"
  top: "block35_3/branch_2/Conv2d_0a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_3/branch_2/Conv2d_0a_1x1/bn"
  type: "BNData"
  bottom: "block35_3/branch_2/Conv2d_0a_1x1"
  top: "block35_3/branch_2/Conv2d_0a_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_3/branch_2/Conv2d_0a_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_3/branch_2/Conv2d_0a_1x1/bn"
  top: "block35_3/branch_2/Conv2d_0a_1x1/bn"
}
layer {
  name: "block35_3/branch_2/Conv2d_0b_3x3"
  type: "ConvolutionData"
  bottom: "block35_3/branch_2/Conv2d_0a_1x1/bn"
  top: "block35_3/branch_2/Conv2d_0b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_3/branch_2/Conv2d_0b_3x3/bn"
  type: "BNData"
  bottom: "block35_3/branch_2/Conv2d_0b_3x3"
  top: "block35_3/branch_2/Conv2d_0b_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_3/branch_2/Conv2d_0b_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_3/branch_2/Conv2d_0b_3x3/bn"
  top: "block35_3/branch_2/Conv2d_0b_3x3/bn"
}
layer {
  name: "block35_3/branch_2/Conv2d_0c_3x3"
  type: "ConvolutionData"
  bottom: "block35_3/branch_2/Conv2d_0b_3x3/bn"
  top: "block35_3/branch_2/Conv2d_0c_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_3/branch_2/Conv2d_0c_3x3/bn"
  type: "BNData"
  bottom: "block35_3/branch_2/Conv2d_0c_3x3"
  top: "block35_3/branch_2/Conv2d_0c_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_3/branch_2/Conv2d_0c_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_3/branch_2/Conv2d_0c_3x3/bn"
  top: "block35_3/branch_2/Conv2d_0c_3x3/bn"
}
layer {
  name: "block35_3/concat"
  type: "Concat"
  bottom: "block35_3/branch_0/Conv2d_1x1/bn"
  bottom: "block35_3/branch_1/Conv2d_0b_3x3/bn"
  bottom: "block35_3/branch_2/Conv2d_0c_3x3/bn"
  top: "block35_3/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block35_3/concat/Conv2d_1x1"
  type: "ConvolutionData"
  bottom: "block35_3/concat"
  top: "block35_3/concat/Conv2d_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "block35_3/eltwise"
  type: "Eltwise"
  bottom: "block35_2/eltwise"
  bottom: "block35_3/concat/Conv2d_1x1"
  top: "block35_3/eltwise"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.17
  }
}
layer {
  name: "block35_3/eltwise/relu"
  type: "ReLU"
  bottom: "block35_3/eltwise"
  top: "block35_3/eltwise"
}
layer {
  name: "block35_4/branch_0/Conv2d_1x1"
  type: "ConvolutionData"
  bottom: "block35_3/eltwise"
  top: "block35_4/branch_0/Conv2d_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_4/branch_0/Conv2d_1x1/bn"
  type: "BNData"
  bottom: "block35_4/branch_0/Conv2d_1x1"
  top: "block35_4/branch_0/Conv2d_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_4/branch_0/Conv2d_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_4/branch_0/Conv2d_1x1/bn"
  top: "block35_4/branch_0/Conv2d_1x1/bn"
}
layer {
  name: "block35_4/branch_1/Conv2d_0a_1x1"
  type: "ConvolutionData"
  bottom: "block35_3/eltwise"
  top: "block35_4/branch_1/Conv2d_0a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_4/branch_1/Conv2d_0a_1x1/bn"
  type: "BNData"
  bottom: "block35_4/branch_1/Conv2d_0a_1x1"
  top: "block35_4/branch_1/Conv2d_0a_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_4/branch_1/Conv2d_0a_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_4/branch_1/Conv2d_0a_1x1/bn"
  top: "block35_4/branch_1/Conv2d_0a_1x1/bn"
}
layer {
  name: "block35_4/branch_1/Conv2d_0b_3x3"
  type: "ConvolutionData"
  bottom: "block35_4/branch_1/Conv2d_0a_1x1/bn"
  top: "block35_4/branch_1/Conv2d_0b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_4/branch_1/Conv2d_0b_3x3/bn"
  type: "BNData"
  bottom: "block35_4/branch_1/Conv2d_0b_3x3"
  top: "block35_4/branch_1/Conv2d_0b_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_4/branch_1/Conv2d_0b_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_4/branch_1/Conv2d_0b_3x3/bn"
  top: "block35_4/branch_1/Conv2d_0b_3x3/bn"
}
layer {
  name: "block35_4/branch_2/Conv2d_0a_1x1"
  type: "ConvolutionData"
  bottom: "block35_3/eltwise"
  top: "block35_4/branch_2/Conv2d_0a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_4/branch_2/Conv2d_0a_1x1/bn"
  type: "BNData"
  bottom: "block35_4/branch_2/Conv2d_0a_1x1"
  top: "block35_4/branch_2/Conv2d_0a_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_4/branch_2/Conv2d_0a_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_4/branch_2/Conv2d_0a_1x1/bn"
  top: "block35_4/branch_2/Conv2d_0a_1x1/bn"
}
layer {
  name: "block35_4/branch_2/Conv2d_0b_3x3"
  type: "ConvolutionData"
  bottom: "block35_4/branch_2/Conv2d_0a_1x1/bn"
  top: "block35_4/branch_2/Conv2d_0b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_4/branch_2/Conv2d_0b_3x3/bn"
  type: "BNData"
  bottom: "block35_4/branch_2/Conv2d_0b_3x3"
  top: "block35_4/branch_2/Conv2d_0b_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_4/branch_2/Conv2d_0b_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_4/branch_2/Conv2d_0b_3x3/bn"
  top: "block35_4/branch_2/Conv2d_0b_3x3/bn"
}
layer {
  name: "block35_4/branch_2/Conv2d_0c_3x3"
  type: "ConvolutionData"
  bottom: "block35_4/branch_2/Conv2d_0b_3x3/bn"
  top: "block35_4/branch_2/Conv2d_0c_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_4/branch_2/Conv2d_0c_3x3/bn"
  type: "BNData"
  bottom: "block35_4/branch_2/Conv2d_0c_3x3"
  top: "block35_4/branch_2/Conv2d_0c_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_4/branch_2/Conv2d_0c_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_4/branch_2/Conv2d_0c_3x3/bn"
  top: "block35_4/branch_2/Conv2d_0c_3x3/bn"
}
layer {
  name: "block35_4/concat"
  type: "Concat"
  bottom: "block35_4/branch_0/Conv2d_1x1/bn"
  bottom: "block35_4/branch_1/Conv2d_0b_3x3/bn"
  bottom: "block35_4/branch_2/Conv2d_0c_3x3/bn"
  top: "block35_4/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block35_4/concat/Conv2d_1x1"
  type: "ConvolutionData"
  bottom: "block35_4/concat"
  top: "block35_4/concat/Conv2d_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "block35_4/eltwise"
  type: "Eltwise"
  bottom: "block35_3/eltwise"
  bottom: "block35_4/concat/Conv2d_1x1"
  top: "block35_4/eltwise"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.17
  }
}
layer {
  name: "block35_4/eltwise/relu"
  type: "ReLU"
  bottom: "block35_4/eltwise"
  top: "block35_4/eltwise"
}
layer {
  name: "block35_5/branch_0/Conv2d_1x1"
  type: "ConvolutionData"
  bottom: "block35_4/eltwise"
  top: "block35_5/branch_0/Conv2d_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_5/branch_0/Conv2d_1x1/bn"
  type: "BNData"
  bottom: "block35_5/branch_0/Conv2d_1x1"
  top: "block35_5/branch_0/Conv2d_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_5/branch_0/Conv2d_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_5/branch_0/Conv2d_1x1/bn"
  top: "block35_5/branch_0/Conv2d_1x1/bn"
}
layer {
  name: "block35_5/branch_1/Conv2d_0a_1x1"
  type: "ConvolutionData"
  bottom: "block35_4/eltwise"
  top: "block35_5/branch_1/Conv2d_0a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_5/branch_1/Conv2d_0a_1x1/bn"
  type: "BNData"
  bottom: "block35_5/branch_1/Conv2d_0a_1x1"
  top: "block35_5/branch_1/Conv2d_0a_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_5/branch_1/Conv2d_0a_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_5/branch_1/Conv2d_0a_1x1/bn"
  top: "block35_5/branch_1/Conv2d_0a_1x1/bn"
}
layer {
  name: "block35_5/branch_1/Conv2d_0b_3x3"
  type: "ConvolutionData"
  bottom: "block35_5/branch_1/Conv2d_0a_1x1/bn"
  top: "block35_5/branch_1/Conv2d_0b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_5/branch_1/Conv2d_0b_3x3/bn"
  type: "BNData"
  bottom: "block35_5/branch_1/Conv2d_0b_3x3"
  top: "block35_5/branch_1/Conv2d_0b_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_5/branch_1/Conv2d_0b_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_5/branch_1/Conv2d_0b_3x3/bn"
  top: "block35_5/branch_1/Conv2d_0b_3x3/bn"
}
layer {
  name: "block35_5/branch_2/Conv2d_0a_1x1"
  type: "ConvolutionData"
  bottom: "block35_4/eltwise"
  top: "block35_5/branch_2/Conv2d_0a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_5/branch_2/Conv2d_0a_1x1/bn"
  type: "BNData"
  bottom: "block35_5/branch_2/Conv2d_0a_1x1"
  top: "block35_5/branch_2/Conv2d_0a_1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_5/branch_2/Conv2d_0a_1x1/bn/relu"
  type: "ReLU"
  bottom: "block35_5/branch_2/Conv2d_0a_1x1/bn"
  top: "block35_5/branch_2/Conv2d_0a_1x1/bn"
}
layer {
  name: "block35_5/branch_2/Conv2d_0b_3x3"
  type: "ConvolutionData"
  bottom: "block35_5/branch_2/Conv2d_0a_1x1/bn"
  top: "block35_5/branch_2/Conv2d_0b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_5/branch_2/Conv2d_0b_3x3/bn"
  type: "BNData"
  bottom: "block35_5/branch_2/Conv2d_0b_3x3"
  top: "block35_5/branch_2/Conv2d_0b_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    moving_average: true
  }
}
layer {
  name: "block35_5/branch_2/Conv2d_0b_3x3/bn/relu"
  type: "ReLU"
  bottom: "block35_5/branch_2/Conv2d_0b_3x3/bn"
  top: "block35_5/branch_2/Conv2d_0b_3x3/bn"
}
layer {
  name: "block35_5/branch_2/Conv2d_0c_3x3"
  type: "ConvolutionData"
  bottom: "block35_5/branch_2/Conv2d_0b_3x3/bn"
  top: "block35_5/branch_2/Conv2d_0c_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block35_5/branch_2/Conv2d_0c_3x3/bn"
  type: "BNData"
  bottom: "block35_5/branch_2/Conv2d_0c_3x3"
  top: "block35_5/branch_2/Conv2d_0c_3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
