name: "resnet101"

layer{
	name: "train_layer"
	type: "ImageData"
	top: "data"
	top: "label"
	image_data_param {
		source: "/furniture/data/train.txt"
        root_folder: "/furniture/data/"
		shuffle: true
		batch_size: 120
		new_height: 224
        new_width: 224
	}
	transform_param {
		mirror: true
        mean_value: 103.939
        mean_value: 116.779
        mean_value: 123.68
	}
	include {
		phase: TRAIN
	}
}

layer{
	name: "test_layer"
	type: "ImageData"
	top: "data"
	top: "label"
	image_data_param {
		source: "/furniture/data/valid.txt"
        root_folder: "/furniture/data/val/"
        shuffle: true
        batch_size: 80
        new_height: 224
        new_width: 224
	}
	transform_param {
		mirror: false
        mean_value: 103.939
        mean_value: 116.779
        mean_value: 123.68
	}
	include {
		phase: TEST
	}
}

layer{
   name: "gather"
   type: "Gather"
   bottom: "label"
   top: "label_g"
}


layer{
	name: "conv1"
	type: "ConvolutionData"
	bottom: "data"
	top: "conv1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 64
		bias_term: false
		pad: 3
		kernel_size: 7
		stride: 2
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "conv1/bn"
	type: "BNData"
	bottom: "conv1"
	top: "conv1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "conv1/bn/relu"
	type: "ReLU"
	bottom: "conv1/bn"
	top: "conv1/bn"
}

layer{
	name: "pool1_3x3_s2"
	type: "Pooling"
	bottom: "conv1/bn"
	top: "pool1_3x3_s2"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
	}
}

layer{
	name: "res1_1/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "pool1_3x3_s2"
	top: "res1_1/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 64
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res1_1/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res1_1/branch1/conv1_1x1"
	top: "res1_1/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res1_1/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res1_1/branch1/conv1_1x1/bn"
	top: "res1_1/branch1/conv1_1x1/bn"
}

layer{
	name: "res1_1/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res1_1/branch1/conv1_1x1/bn"
	top: "res1_1/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 64
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res1_1/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res1_1/branch1/conv2_3x3"
	top: "res1_1/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res1_1/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res1_1/branch1/conv2_3x3/bn"
	top: "res1_1/branch1/conv2_3x3/bn"
}

layer{
	name: "res1_1/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res1_1/branch1/conv2_3x3/bn"
	top: "res1_1/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res1_1/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res1_1/branch1/conv3_1x1"
	top: "res1_1/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res1_1/branch2/conv1_1x1"
	type: "ConvolutionData"
	bottom: "pool1_3x3_s2"
	top: "res1_1/branch2/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res1_1/branch2/conv1_1x1/bn"
	type: "BNData"
	bottom: "res1_1/branch2/conv1_1x1"
	top: "res1_1/branch2/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res1_1"
	type: "Eltwise"
	bottom: "res1_1/branch1/conv3_1x1/bn"
	bottom: "res1_1/branch2/conv1_1x1/bn"
	top: "res1_1"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res1_1/relu"
	type: "ReLU"
	bottom: "res1_1"
	top: "res1_1"
}

layer{
	name: "res1_2/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res1_1"
	top: "res1_2/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 64
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res1_2/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res1_2/branch1/conv1_1x1"
	top: "res1_2/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res1_2/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res1_2/branch1/conv1_1x1/bn"
	top: "res1_2/branch1/conv1_1x1/bn"
}

layer{
	name: "res1_2/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res1_2/branch1/conv1_1x1/bn"
	top: "res1_2/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 64
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res1_2/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res1_2/branch1/conv2_3x3"
	top: "res1_2/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res1_2/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res1_2/branch1/conv2_3x3/bn"
	top: "res1_2/branch1/conv2_3x3/bn"
}

layer{
	name: "res1_2/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res1_2/branch1/conv2_3x3/bn"
	top: "res1_2/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res1_2/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res1_2/branch1/conv3_1x1"
	top: "res1_2/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res1_2"
	type: "Eltwise"
	bottom: "res1_2/branch1/conv3_1x1/bn"
	bottom: "res1_1"
	top: "res1_2"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res1_2/relu"
	type: "ReLU"
	bottom: "res1_2"
	top: "res1_2"
}

layer{
	name: "res1_3/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res1_2"
	top: "res1_3/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 64
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res1_3/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res1_3/branch1/conv1_1x1"
	top: "res1_3/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res1_3/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res1_3/branch1/conv1_1x1/bn"
	top: "res1_3/branch1/conv1_1x1/bn"
}

layer{
	name: "res1_3/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res1_3/branch1/conv1_1x1/bn"
	top: "res1_3/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 64
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res1_3/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res1_3/branch1/conv2_3x3"
	top: "res1_3/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res1_3/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res1_3/branch1/conv2_3x3/bn"
	top: "res1_3/branch1/conv2_3x3/bn"
}

layer{
	name: "res1_3/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res1_3/branch1/conv2_3x3/bn"
	top: "res1_3/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res1_3/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res1_3/branch1/conv3_1x1"
	top: "res1_3/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res1_3"
	type: "Eltwise"
	bottom: "res1_3/branch1/conv3_1x1/bn"
	bottom: "res1_2"
	top: "res1_3"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res1_3/relu"
	type: "ReLU"
	bottom: "res1_3"
	top: "res1_3"
}

layer{
	name: "res2_1/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res1_3"
	top: "res2_1/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res2_1/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res2_1/branch1/conv1_1x1"
	top: "res2_1/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res2_1/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res2_1/branch1/conv1_1x1/bn"
	top: "res2_1/branch1/conv1_1x1/bn"
}

layer{
	name: "res2_1/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res2_1/branch1/conv1_1x1/bn"
	top: "res2_1/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 2
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res2_1/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res2_1/branch1/conv2_3x3"
	top: "res2_1/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res2_1/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res2_1/branch1/conv2_3x3/bn"
	top: "res2_1/branch1/conv2_3x3/bn"
}

layer{
	name: "res2_1/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res2_1/branch1/conv2_3x3/bn"
	top: "res2_1/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 512
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res2_1/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res2_1/branch1/conv3_1x1"
	top: "res2_1/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res2_1/branch2/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res1_3"
	top: "res2_1/branch2/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 512
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 2
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res2_1/branch2/conv1_1x1/bn"
	type: "BNData"
	bottom: "res2_1/branch2/conv1_1x1"
	top: "res2_1/branch2/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res2_1"
	type: "Eltwise"
	bottom: "res2_1/branch1/conv3_1x1/bn"
	bottom: "res2_1/branch2/conv1_1x1/bn"
	top: "res2_1"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res2_1/relu"
	type: "ReLU"
	bottom: "res2_1"
	top: "res2_1"
}

layer{
	name: "res2_2/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res2_1"
	top: "res2_2/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res2_2/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res2_2/branch1/conv1_1x1"
	top: "res2_2/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res2_2/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res2_2/branch1/conv1_1x1/bn"
	top: "res2_2/branch1/conv1_1x1/bn"
}

layer{
	name: "res2_2/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res2_2/branch1/conv1_1x1/bn"
	top: "res2_2/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res2_2/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res2_2/branch1/conv2_3x3"
	top: "res2_2/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res2_2/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res2_2/branch1/conv2_3x3/bn"
	top: "res2_2/branch1/conv2_3x3/bn"
}

layer{
	name: "res2_2/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res2_2/branch1/conv2_3x3/bn"
	top: "res2_2/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 512
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res2_2/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res2_2/branch1/conv3_1x1"
	top: "res2_2/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res2_2"
	type: "Eltwise"
	bottom: "res2_2/branch1/conv3_1x1/bn"
	bottom: "res2_1"
	top: "res2_2"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res2_2/relu"
	type: "ReLU"
	bottom: "res2_2"
	top: "res2_2"
}

layer{
	name: "res2_3/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res2_2"
	top: "res2_3/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res2_3/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res2_3/branch1/conv1_1x1"
	top: "res2_3/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res2_3/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res2_3/branch1/conv1_1x1/bn"
	top: "res2_3/branch1/conv1_1x1/bn"
}

layer{
	name: "res2_3/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res2_3/branch1/conv1_1x1/bn"
	top: "res2_3/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res2_3/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res2_3/branch1/conv2_3x3"
	top: "res2_3/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res2_3/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res2_3/branch1/conv2_3x3/bn"
	top: "res2_3/branch1/conv2_3x3/bn"
}

layer{
	name: "res2_3/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res2_3/branch1/conv2_3x3/bn"
	top: "res2_3/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 512
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res2_3/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res2_3/branch1/conv3_1x1"
	top: "res2_3/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res2_3"
	type: "Eltwise"
	bottom: "res2_3/branch1/conv3_1x1/bn"
	bottom: "res2_2"
	top: "res2_3"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res2_3/relu"
	type: "ReLU"
	bottom: "res2_3"
	top: "res2_3"
}

layer{
	name: "res2_4/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res2_3"
	top: "res2_4/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res2_4/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res2_4/branch1/conv1_1x1"
	top: "res2_4/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res2_4/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res2_4/branch1/conv1_1x1/bn"
	top: "res2_4/branch1/conv1_1x1/bn"
}

layer{
	name: "res2_4/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res2_4/branch1/conv1_1x1/bn"
	top: "res2_4/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res2_4/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res2_4/branch1/conv2_3x3"
	top: "res2_4/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res2_4/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res2_4/branch1/conv2_3x3/bn"
	top: "res2_4/branch1/conv2_3x3/bn"
}

layer{
	name: "res2_4/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res2_4/branch1/conv2_3x3/bn"
	top: "res2_4/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 512
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res2_4/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res2_4/branch1/conv3_1x1"
	top: "res2_4/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res2_4"
	type: "Eltwise"
	bottom: "res2_4/branch1/conv3_1x1/bn"
	bottom: "res2_3"
	top: "res2_4"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res2_4/relu"
	type: "ReLU"
	bottom: "res2_4"
	top: "res2_4"
}

layer{
	name: "res3_1/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res2_4"
	top: "res3_1/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_1/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res3_1/branch1/conv1_1x1"
	top: "res3_1/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_1/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res3_1/branch1/conv1_1x1/bn"
	top: "res3_1/branch1/conv1_1x1/bn"
}

layer{
	name: "res3_1/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res3_1/branch1/conv1_1x1/bn"
	top: "res3_1/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 2
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_1/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res3_1/branch1/conv2_3x3"
	top: "res3_1/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_1/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res3_1/branch1/conv2_3x3/bn"
	top: "res3_1/branch1/conv2_3x3/bn"
}

layer{
	name: "res3_1/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res3_1/branch1/conv2_3x3/bn"
	top: "res3_1/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 1024
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_1/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res3_1/branch1/conv3_1x1"
	top: "res3_1/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_1/branch2/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res2_4"
	top: "res3_1/branch2/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 1024
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 2
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_1/branch2/conv1_1x1/bn"
	type: "BNData"
	bottom: "res3_1/branch2/conv1_1x1"
	top: "res3_1/branch2/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_1"
	type: "Eltwise"
	bottom: "res3_1/branch1/conv3_1x1/bn"
	bottom: "res3_1/branch2/conv1_1x1/bn"
	top: "res3_1"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res3_1/relu"
	type: "ReLU"
	bottom: "res3_1"
	top: "res3_1"
}

layer{
	name: "res3_2/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res3_1"
	top: "res3_2/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_2/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res3_2/branch1/conv1_1x1"
	top: "res3_2/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_2/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res3_2/branch1/conv1_1x1/bn"
	top: "res3_2/branch1/conv1_1x1/bn"
}

layer{
	name: "res3_2/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res3_2/branch1/conv1_1x1/bn"
	top: "res3_2/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_2/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res3_2/branch1/conv2_3x3"
	top: "res3_2/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_2/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res3_2/branch1/conv2_3x3/bn"
	top: "res3_2/branch1/conv2_3x3/bn"
}

layer{
	name: "res3_2/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res3_2/branch1/conv2_3x3/bn"
	top: "res3_2/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 1024
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_2/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res3_2/branch1/conv3_1x1"
	top: "res3_2/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_2"
	type: "Eltwise"
	bottom: "res3_2/branch1/conv3_1x1/bn"
	bottom: "res3_1"
	top: "res3_2"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res3_2/relu"
	type: "ReLU"
	bottom: "res3_2"
	top: "res3_2"
}

layer{
	name: "res3_3/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res3_2"
	top: "res3_3/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_3/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res3_3/branch1/conv1_1x1"
	top: "res3_3/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_3/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res3_3/branch1/conv1_1x1/bn"
	top: "res3_3/branch1/conv1_1x1/bn"
}

layer{
	name: "res3_3/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res3_3/branch1/conv1_1x1/bn"
	top: "res3_3/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_3/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res3_3/branch1/conv2_3x3"
	top: "res3_3/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_3/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res3_3/branch1/conv2_3x3/bn"
	top: "res3_3/branch1/conv2_3x3/bn"
}

layer{
	name: "res3_3/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res3_3/branch1/conv2_3x3/bn"
	top: "res3_3/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 1024
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_3/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res3_3/branch1/conv3_1x1"
	top: "res3_3/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_3"
	type: "Eltwise"
	bottom: "res3_3/branch1/conv3_1x1/bn"
	bottom: "res3_2"
	top: "res3_3"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res3_3/relu"
	type: "ReLU"
	bottom: "res3_3"
	top: "res3_3"
}

layer{
	name: "res3_4/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res3_3"
	top: "res3_4/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_4/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res3_4/branch1/conv1_1x1"
	top: "res3_4/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_4/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res3_4/branch1/conv1_1x1/bn"
	top: "res3_4/branch1/conv1_1x1/bn"
}

layer{
	name: "res3_4/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res3_4/branch1/conv1_1x1/bn"
	top: "res3_4/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_4/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res3_4/branch1/conv2_3x3"
	top: "res3_4/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_4/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res3_4/branch1/conv2_3x3/bn"
	top: "res3_4/branch1/conv2_3x3/bn"
}

layer{
	name: "res3_4/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res3_4/branch1/conv2_3x3/bn"
	top: "res3_4/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 1024
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_4/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res3_4/branch1/conv3_1x1"
	top: "res3_4/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_4"
	type: "Eltwise"
	bottom: "res3_4/branch1/conv3_1x1/bn"
	bottom: "res3_3"
	top: "res3_4"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res3_4/relu"
	type: "ReLU"
	bottom: "res3_4"
	top: "res3_4"
}

layer{
	name: "res3_5/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res3_4"
	top: "res3_5/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_5/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res3_5/branch1/conv1_1x1"
	top: "res3_5/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_5/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res3_5/branch1/conv1_1x1/bn"
	top: "res3_5/branch1/conv1_1x1/bn"
}

layer{
	name: "res3_5/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res3_5/branch1/conv1_1x1/bn"
	top: "res3_5/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_5/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res3_5/branch1/conv2_3x3"
	top: "res3_5/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_5/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res3_5/branch1/conv2_3x3/bn"
	top: "res3_5/branch1/conv2_3x3/bn"
}

layer{
	name: "res3_5/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res3_5/branch1/conv2_3x3/bn"
	top: "res3_5/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 1024
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_5/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res3_5/branch1/conv3_1x1"
	top: "res3_5/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_5"
	type: "Eltwise"
	bottom: "res3_5/branch1/conv3_1x1/bn"
	bottom: "res3_4"
	top: "res3_5"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res3_5/relu"
	type: "ReLU"
	bottom: "res3_5"
	top: "res3_5"
}

layer{
	name: "res3_6/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res3_5"
	top: "res3_6/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_6/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res3_6/branch1/conv1_1x1"
	top: "res3_6/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_6/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res3_6/branch1/conv1_1x1/bn"
	top: "res3_6/branch1/conv1_1x1/bn"
}

layer{
	name: "res3_6/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res3_6/branch1/conv1_1x1/bn"
	top: "res3_6/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_6/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res3_6/branch1/conv2_3x3"
	top: "res3_6/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_6/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res3_6/branch1/conv2_3x3/bn"
	top: "res3_6/branch1/conv2_3x3/bn"
}

layer{
	name: "res3_6/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res3_6/branch1/conv2_3x3/bn"
	top: "res3_6/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 1024
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_6/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res3_6/branch1/conv3_1x1"
	top: "res3_6/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_6"
	type: "Eltwise"
	bottom: "res3_6/branch1/conv3_1x1/bn"
	bottom: "res3_5"
	top: "res3_6"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res3_6/relu"
	type: "ReLU"
	bottom: "res3_6"
	top: "res3_6"
}

layer{
	name: "res3_7/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res3_6"
	top: "res3_7/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_7/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res3_7/branch1/conv1_1x1"
	top: "res3_7/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_7/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res3_7/branch1/conv1_1x1/bn"
	top: "res3_7/branch1/conv1_1x1/bn"
}

layer{
	name: "res3_7/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res3_7/branch1/conv1_1x1/bn"
	top: "res3_7/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_7/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res3_7/branch1/conv2_3x3"
	top: "res3_7/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_7/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res3_7/branch1/conv2_3x3/bn"
	top: "res3_7/branch1/conv2_3x3/bn"
}

layer{
	name: "res3_7/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res3_7/branch1/conv2_3x3/bn"
	top: "res3_7/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 1024
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_7/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res3_7/branch1/conv3_1x1"
	top: "res3_7/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_7"
	type: "Eltwise"
	bottom: "res3_7/branch1/conv3_1x1/bn"
	bottom: "res3_6"
	top: "res3_7"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res3_7/relu"
	type: "ReLU"
	bottom: "res3_7"
	top: "res3_7"
}

layer{
	name: "res3_8/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res3_7"
	top: "res3_8/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_8/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res3_8/branch1/conv1_1x1"
	top: "res3_8/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_8/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res3_8/branch1/conv1_1x1/bn"
	top: "res3_8/branch1/conv1_1x1/bn"
}

layer{
	name: "res3_8/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res3_8/branch1/conv1_1x1/bn"
	top: "res3_8/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_8/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res3_8/branch1/conv2_3x3"
	top: "res3_8/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_8/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res3_8/branch1/conv2_3x3/bn"
	top: "res3_8/branch1/conv2_3x3/bn"
}

layer{
	name: "res3_8/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res3_8/branch1/conv2_3x3/bn"
	top: "res3_8/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 1024
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_8/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res3_8/branch1/conv3_1x1"
	top: "res3_8/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_8"
	type: "Eltwise"
	bottom: "res3_8/branch1/conv3_1x1/bn"
	bottom: "res3_7"
	top: "res3_8"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res3_8/relu"
	type: "ReLU"
	bottom: "res3_8"
	top: "res3_8"
}

layer{
	name: "res3_9/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res3_8"
	top: "res3_9/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_9/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res3_9/branch1/conv1_1x1"
	top: "res3_9/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_9/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res3_9/branch1/conv1_1x1/bn"
	top: "res3_9/branch1/conv1_1x1/bn"
}

layer{
	name: "res3_9/branch1/conv2_3x3"
	type: "ConvolutionData"
	bottom: "res3_9/branch1/conv1_1x1/bn"
	top: "res3_9/branch1/conv2_3x3"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_9/branch1/conv2_3x3/bn"
	type: "BNData"
	bottom: "res3_9/branch1/conv2_3x3"
	top: "res3_9/branch1/conv2_3x3/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_9/branch1/conv2_3x3/bn/relu"
	type: "ReLU"
	bottom: "res3_9/branch1/conv2_3x3/bn"
	top: "res3_9/branch1/conv2_3x3/bn"
}

layer{
	name: "res3_9/branch1/conv3_1x1"
	type: "ConvolutionData"
	bottom: "res3_9/branch1/conv2_3x3/bn"
	top: "res3_9/branch1/conv3_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 1024
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_9/branch1/conv3_1x1/bn"
	type: "BNData"
	bottom: "res3_9/branch1/conv3_1x1"
	top: "res3_9/branch1/conv3_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_9"
	type: "Eltwise"
	bottom: "res3_9/branch1/conv3_1x1/bn"
	bottom: "res3_8"
	top: "res3_9"
	eltwise_param {
		operation: SUM
	}
}

layer{
	name: "res3_9/relu"
	type: "ReLU"
	bottom: "res3_9"
	top: "res3_9"
}

layer{
	name: "res3_10/branch1/conv1_1x1"
	type: "ConvolutionData"
	bottom: "res3_9"
	top: "res3_10/branch1/conv1_1x1"
	param{
		lr_mult: 1
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		bias_term: false
		pad: 0
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
	}
}

layer{
	name: "res3_10/branch1/conv1_1x1/bn"
	type: "BNData"
	bottom: "res3_10/branch1/conv1_1x1"
	top: "res3_10/branch1/conv1_1x1/bn"
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 1
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	param{
		lr_mult: 0
		decay_mult: 0
	}
	bn_param {
		scale_filler {
			type: "constant"
			value: 1
		}
		shift_filler {
			type: "constant"
			value: 0
		}
		moving_average: true
		decay: 0.05
	}
}

layer{
	name: "res3_10/branch1/conv1_1x1/bn/relu"
	type: "ReLU"
	bottom: "res3_10/branch1/conv1_1x1/bn"
	top: "res3_10/branch1/conv1_1x1/bn"
}

layer{
	name: "res3_10/branch1/conv2_3x3"
	type: "ConvolutionData"
